{
  "home": "Home",
  "stack1": "Stack",
  "projects1": "Projects",
  "blog1": "Blog",
  "contacts1": "Contacts",
  "home1": {
    "title": "Hello, I'm <span class='text-blue-600 dark:text-blue-400'>Yassar WABI</span> Software Engineer",
    "description": "Software Engineer specialized in Artificial Intelligence and modern Web development. I combine Python expertise (TensorFlow, FastAPI, OpenCV) with Web power (Next.js, TypeScript) to create intelligent, scalable solutions: hybrid RAG systems, voice assistants, AI-powered analyzers and smart CRMs. Each project demonstrates my ability to transform complex technical challenges into high-performance products that blend advanced algorithms with modern user interfaces.",
    "myStack": "My Stack",
    "seeProjects": "See My Projects",
    "downloadCV": "Download CV",
    "contactMe": "Contact Me"
  },
  "stack": {
    "title": "My Technical Stack",
    "technologies": {
      "Next.js": "Next.js",
      "HTML": "HTML",
      "CSS": "CSS",
      "TypeScript": "TypeScript",
      "React": "React",
      "Tailwind CSS": "Tailwind CSS",
      "JavaScript": "JavaScript",
      "Node.js": "Node.js",
      "Git": "Git",
      "GitHub": "GitHub",
      "Docker": "Docker",
      "GSAP": "GSAP",
      "Python": "Python",
      "TensorFlow": "TensorFlow",
      "PyTorch": "PyTorch",
      "Keras": "Keras",
      "OpenCV": "OpenCV",
      "Flask": "Flask",
      "FastAPI": "FastAPI",
      "Firebase": "Firebase",
      "LangChain": "LangChain",
      "Pandas": "Pandas",
      "FAISS": "FAISS"
    }
  },
  "projects": {
    "title": "My Projects",
    "link": "See the project →",
    "seeDetails": "See details",
    "backToProjects": "← Back to projects",
    "viewOnGitHub": "View on GitHub",
    "visitDemo": "Visit demo",
    "technologies": "Technologies used",
    "features": "Features",
    "description": "Description",
    "noDescription": "No description available"
  },
  "yatouze": {
    "description": "Yatouze simplifies and automates key management processes for your business, unlocking its potential. By fostering collaboration and improving employee productivity, Yatouze enables informed decision-making through accurate data."
  },
  "cinematch": {
    "description": "Cinematch is a personalized movie recommendation platform, based on a model trained on over 600,000 films. Thanks to an intelligent algorithm, it analyzes user tastes, favorite genres and ratings to offer tailored suggestions. Simple and intuitive, Cinematch makes it easy to discover new content that perfectly matches your preferences."
  },
  "akronim": {
    "description": "AKRONIM website is a modern institutional showcase developed with Next.js, TypeScript and Tailwind CSS, highlighting the university's academic excellence in the fields of computer science and management. The interface uses an elegant glassmorphism design with GSAP animations and Framer Motion transitions for a smooth user experience. The whole is enriched with professional images and interactive elements that guide visitors to the various courses offered. Note that AKRONIM remains fictional."
  },
  "replica": {
    "description": "REPLICA application is a web tool that allows you to convert and duplicate phone numbers in a VCF contact file. Users can upload their VCF file, and the application automatically creates a secondary copy of each phone number with a modified format. The user then has two download options: either a file containing both the original and modified numbers, or only the modified numbers. The interface is simple, with a modern design in dark gradient and carousel animations to guide the user."
  },
  "rpmanager": {
    "description": "RPManager is a tool for managing daily work reports in the form of a Progressive Web App (PWA). It allows users to create detailed reports including their work schedules (arrival/departure), their tasks performed with the corresponding hours, and the work planned for the next day. The application offers a modern interface with GSAP animations, local storage via IndexedDB to work offline, and the ability to generate PDFs of reports. It also includes features such as searching for past reports by date, the possibility of installation on the device (PWA), and a responsive layout with an elegant design using glassmorphism effects and a dark theme."
  },
  "ficheinfo": {
    "description": "FicheInfo is a web application developed with Next.js, which allows employees to efficiently manage their assignments and track their progress. It also offers the possibility to create detailed daily reports including the date, arrival and departure times, tasks performed in chronological order, as well as problems encountered per task. Reports can be exported in PDF format, facilitating their sharing and archiving."
  },
  "permix": {
    "description": "Permix is a web application PWA for revising the Beninese code of the route, offering a revision mode (questions in order with immediate answers) and an exam mode (50 random questions, timer, final score), with interactive summary, GSAP animations, local storage of progress, offline operation and deployment on Vercel."
  },
  "explorebenin": {
    "description": "ExploreBenin is an interactive web application that presents the tourist sites, cultural and natural sites of Benin, with maps, descriptive cards, image galleries, and a search engine."
  },
  "kimizone": {
    "description": "Kimizone is a Tunisian streetwear brand concept, focused on original urban creations blending local identity, modern graphics, and global influences, with a particular attention to designs, materials, and cultural expression."
  },
  "omshina": {
    "description": "OMSHINA International Recruitment is a multi-service international recruitment platform that accompanies students, workers, artists, and other profiles in their mobility and integration abroad."
  },
  "pneumo": {
    "description": "Pneumo is a modern web application designed for the medical tracking of respiratory diseases and the management of health data, appointments, and analysis results."
  },
  "vix": {
    "description": "Vix is a Python application that generates intelligent SQL queries from natural language commands (Ex:'What is the sales figure for the last 3 months?'). It uses LangChain and Google Generative AI (Gemini), and supports multiple database management systems (DBMS)."
  },
  "contact": {
    "title": "Contact Me",
    "whatsapp": "WhatsApp"
  },
  "blog": {
    "title": "Blog",
    "readMore": "Read more",
    "readTime": "min read",
    "backToBlog": "Back to blog",
    "publishedOn": "Published on",
    "tags": "Tags"
  }
}
